In [ ]:
from db_connection import get_connection
from tabulate import tabulate

## Company Database - Departments & Employees

### 1. Table Creation

```sql
-- Drop tables if they exist (optional - useful during development)
DROP TABLE IF EXISTS employees;
DROP TABLE IF EXISTS departments;

-- Departments table
CREATE TABLE departments (
    dept_id    INT          PRIMARY KEY,
    dept_name  VARCHAR(50)  NOT NULL
);

-- Employees table
CREATE TABLE employees (
    emp_id     INT          PRIMARY KEY,
    name       VARCHAR(100) NOT NULL,
    dept_id    INT,                    -- can be NULL (employee with no department)
    salary     INT          NOT NULL,
    FOREIGN KEY (dept_id) REFERENCES departments(dept_id)
);

-- Insert departments
INSERT INTO departments (dept_id, dept_name) VALUES
(1, 'Sales'),
(2, 'IT'),
(3, 'HR');

-- Insert employees (including one with no department)
INSERT INTO employees (emp_id, name, dept_id, salary) VALUES
(1, 'Alice', 1, 50000),
(2, 'Bob',   1, 60000),
(3, 'Carol', 2, 70000),
(4, 'David', NULL, 55000);   -- No department assigned

# Basic SQL joins Exercises  
Perfect for beginners in Jupyter Notebook!

```sql
-- YOUR TASK 1: INNER JOIN - Show employees with their department names
-- YOUR TASK 2: LEFT JOIN - Show all employees including those without departments
-- YOUR TASK 3: RIGHT JOIN - Show all departments including those with no employees

In [ ]:
sql = """
    select *
    from employees e
    join departments d
    on e.dept_id = d.dept_id
"""

In [ ]:
sql = """
    select *
    from employees e
    join departments d
    on e.dept_id = d.dept_id
"""

In [ ]:

sql = """
    select *
    from departments d
    left join employees e
    on d.dept_id = e.dept_id
"""

In [ ]:
with get_connection() as connection:
    with connection.cursor() as cursor:
        cursor.execute(sql)
        rows = cursor.fetchall()
        headers = [desc[0] for desc in cursor.description] # type: ignore

print(tabulate(rows, headers=headers, tablefmt="psql"))

# Basic SQL find missing data Exercises  
Perfect for beginners in Jupyter Notebook!

```sql
-- Using tables from Exercise 1
-- YOUR TASK 1: Find employees who don't have a department (WHERE dept_name IS NULL)
-- YOUR TASK 2: Find departments with no employees (use RIGHT JOIN or LEFT JOIN)

In [ ]:
sql = """
    select *
    from employees e
    left join departments d
    on e.dept_id = d.dept_id
    where d.dept_id is null
"""

In [ ]:
sql = """
    select *
    from departments d
    left join employees e
    on e.dept_id = d.dept_id
    where e.emp_id is null
"""

In [ ]:
with get_connection() as connection:
    with connection.cursor() as cursor:
        cursor.execute(sql)
        rows = cursor.fetchall()
        headers = [desc[0] for desc in cursor.description] # type: ignore

print(tabulate(rows, headers=headers, tablefmt="psql"))

# Basic SQL multiple join data Exercises  
Perfect for beginners in Jupyter Notebook!

```sql
-- YOUR TASK: Join all three tables to show:
-- book title, author name, publisher name

# SQL Join Exercise - Three Table Join

## Database Schema

```sql
CREATE TABLE authors (
    author_id   INT PRIMARY KEY,
    author_name VARCHAR(100)
);

CREATE TABLE publishers (
    publisher_id   INT PRIMARY KEY,
    publisher_name VARCHAR(100)
);

CREATE TABLE books (
    book_id     INT PRIMARY KEY,
    title       VARCHAR(200),
    author_id   INT,
    publisher_id INT,
    FOREIGN KEY (author_id)    REFERENCES authors(author_id),
    FOREIGN KEY (publisher_id) REFERENCES publishers(publisher_id)
);
-- Authors
INSERT INTO authors (author_id, author_name) VALUES
(1, 'J.K. Rowling'),
(2, 'George Orwell');

-- Publishers
INSERT INTO publishers (publisher_id, publisher_name) VALUES
(1, 'Penguin'),
(2, 'Bloomsbury');

-- Books
INSERT INTO books (book_id, title, author_id, publisher_id) VALUES
(1, 'Harry Potter',    1, 2),
(2, '1984',            2, 1),
(3, 'Animal Farm',     2, 1);

In [ ]:
sql = """
    select b.title,a.author_name,p.publisher_name
    from authors a
    join books b on a.author_id = b.author_id
    join publishers p on b.publisher_id = p.publisher_id
"""

In [ ]:
with get_connection() as connection:
    with connection.cursor() as cursor:
        cursor.execute(sql)
        rows = cursor.fetchall()
        headers = [desc[0] for desc in cursor.description] # type: ignore

print(tabulate(rows, headers=headers, tablefmt="psql"))